#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	//++Диплом
	Для Каждого Строка Из Объект.ОтпускаСотрудников Цикл
		Если Строка.Более28 Тогда
			ТекстСообщения = СтрШаблон("Превышено количество дней отпуска у сотрудника: %1 ", Строка.Сотрудник);
			Сообщить(ТекстСообщения);
			ТекущийОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);	
		КонецЕсли;	
	КонецЦикла;
	//конец
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция СформироватьДанныеДляВременногоХранилища() 
	//++Диплом
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Номер", ДокументОбъект.Номер);
	ПараметрыФормы.Вставить("Дата", ДокументОбъект.Дата);
    ПараметрыФормы.Вставить("Год", ДокументОбъект.Год);
	ПараметрыФормы.Вставить("ОтпускаСотрудников", ДокументОбъект["ОтпускаСотрудников"].Выгрузить());
	
	//Адрес = ПоместитьВоВременноеХранилище(ПараметрыФормы, Новый УникальныйИдентификатор);
	Адрес = ПоместитьВоВременноеХранилище(ПараметрыФормы);
	
	Возврат Адрес;
    //конец
КонецФункции

&НаКлиенте
Процедура ОткрытьАнализГрафика(Команда)
	//++Диплом
	ПараметрыДляПередачи = новый Структура("Адрес", СформироватьДанныеДляВременногоХранилища());
	ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.АнализГрафика", ПараметрыДляПередачи);  
	//конец
КонецПроцедуры

#КонецОбласти







	
	
