
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//++ доработка диплома 
	ВывестиРеквизитыПрограммноНаФорму();
	//-- конец доработки диплома	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент) 
	
	//++ доработка диплома	
	Если Элементы.ВидДоговора.ВыделенныйТекст = "Абонентское обслуживание" Тогда
		Элементы.ВКМ_ДатаНачалаДействияДоговора.Видимость = Истина;
		Элементы.ВКМ_ДатаОкончанияДействияДоговора.Видимость = Истина;
		Элементы.ВКМ_СуммаАбонентскойПлатыЕжемесячно.Видимость = Истина;
		Элементы.ВКМ_СтоимостьЧасаРабот.Видимость = Истина;
	Иначе
		Элементы.ВКМ_ДатаНачалаДействияДоговора.Видимость = Ложь;
		Элементы.ВКМ_ДатаОкончанияДействияДоговора.Видимость = Ложь;
		Элементы.ВКМ_СуммаАбонентскойПлатыЕжемесячно.Видимость = Ложь;
		Элементы.ВКМ_СтоимостьЧасаРабот.Видимость = Ложь;
	КонецЕсли;
	//-- конец доработки диплома
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ВывестиРеквизитыПрограммноНаФорму()
	
	//++ доработка диплома
	ГруппаСрокДоговора = Элементы.Добавить("ГруппаСрокДоговора", Тип("ГруппаФормы"));
	ГруппаСрокДоговора.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаСрокДоговора.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	
	РеквизитДатаНачала = Элементы.Добавить("ВКМ_ДатаНачалаДействияДоговора", Тип("ПолеФормы"), ГруппаСрокДоговора);
	РеквизитДатаНачала.Вид = ВидПоляФормы.ПолеВвода;
	РеквизитДатаНачала.ПутьКДанным = "Объект.ВКМ_ДатаНачалаДействияДоговора";
	РеквизитДатаНачала.Заголовок = "Дата начала действия договора";
	РеквизитДатаНачала.Видимость = Ложь;
	
	РеквизитДатаОкончания = Элементы.Добавить("ВКМ_ДатаОкончанияДействияДоговора", Тип("ПолеФормы"), ГруппаСрокДоговора); 
	РеквизитДатаОкончания.Вид =      ВидПоляФормы.ПолеВвода;
	РеквизитДатаОкончания.ПутьКДанным = "Объект.ВКМ_ДатаОкончанияДействияДоговора";
	РеквизитДатаОкончания.Заголовок = "Дата окончания действия договора";
	РеквизитДатаОкончания.Видимость = Ложь;
	
	ГруппаСтоимость = Элементы.Добавить("ГруппаСтоимость", Тип("ГруппаФормы"));
	ГруппаСтоимость.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаСтоимость.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;		
	
	РеквизитСуммаАбПлаты = Элементы.Добавить("ВКМ_СуммаАбонентскойПлатыЕжемесячно", Тип("ПолеФормы"), ГруппаСтоимость);
	РеквизитСуммаАбПлаты.Вид = ВидПоляФормы.ПолеВвода;
	РеквизитСуммаАбПлаты.ПутьКДанным = "Объект.ВКМ_СуммаАбонентскойПлатыЕжемесячно";
	РеквизитСуммаАбПлаты.Заголовок = "Сумма абонентской платы (ежемесячно)";
	РеквизитСуммаАбПлаты.Видимость = Ложь;
	
	РеквизитСтоимостьЧаса = Элементы.Добавить("ВКМ_СтоимостьЧасаРабот", Тип("ПолеФормы"), ГруппаСтоимость);
	РеквизитСтоимостьЧаса.Вид = ВидПоляФормы.ПолеВвода;
	РеквизитСтоимостьЧаса.ПутьКДанным = "Объект.ВКМ_СтоимостьЧасаРабот";
	РеквизитСтоимостьЧаса.Заголовок = "Стоимость часа работ";
	РеквизитСтоимостьЧаса.Видимость = Ложь;
	//-- конец доработки диплома	
КонецПроцедуры	

#КонецОбласти
