
#Область ПрограммныйИнтерфейс 

Процедура ОтправитьСообщение (ТокенТелеграмБота, ИдентификаторГруппы, ТекстСообщения) Экспорт
	//++Диплом
	ТокенТелеграмБота = Константы.ВКМ_ТокенУправленияТелеграмБотом.Получить();
	ИдентификаторГруппы = Константы.ВКМ_ИдентификаторГруппыДляОповещения.Получить();
	
	Соединение = Новый HTTPСоединение("api.telegram.org", 443 ,,,,, Новый ЗащищенноеСоединениеOpenSSL());
	ТокенБота = "/bot" + ТокенТелеграмБота + "/sendMessage";
	
	Параметры1 = Новый Структура;
	Параметры1.Вставить("chat_id", ИдентификаторГруппы);
	Параметры1.Вставить("text", ТекстСообщения);
	
	ЗаписьJSON = Новый ЗаписьJSON();
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, Параметры1);
	ТелоЗапроса = ЗаписьJSON.Закрыть(); 
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type", "application/json");
	Запрос = Новый HTTPЗапрос(ТокенБота, Заголовки);
    	
	Запрос.УстановитьТелоИзСтроки(ТелоЗапроса);
	Ответ = Соединение.ОтправитьДляОбработки(Запрос);
	//Ответ = Соединение.ОтправитьДляОбработкиАсинх(Запрос);
	
	Ответ = Соединение.Получить(Запрос);
	
	Если Ответ.КодСостояния <> 200 Тогда
		Результат = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации("Ошибка Обслуживания клиентов", УровеньЖурналаРегистрации.Ошибка,,,
			Результат);	
	КонецЕсли;

//конец	
КонецПроцедуры	

Процедура ОбходУведомленийТелеграмБоту() Экспорт
	//++Диплом
	ТокенТелеграмБота = Константы.ВКМ_ТокенУправленияТелеграмБотом.Получить();
	ИдентификаторГруппы = Константы.ВКМ_ИдентификаторГруппыДляОповещения.Получить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_УведомленияТелеграмБоту.ТекстСообщения КАК ТекстСообщения,
		|	ВКМ_УведомленияТелеграмБоту.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ВКМ_УведомленияТелеграмБоту КАК ВКМ_УведомленияТелеграмБоту";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ОтправитьСообщение (ТокенТелеграмБота, ИдентификаторГруппы, Выборка.ТекстСообщения);
		СсылкаНаЭлемент = Выборка.Ссылка;
		Объект = СсылкаНаЭлемент.ПолучитьОбъект();
		Объект.Удалить();
	КонецЦикла;
	//конец	
КонецПроцедуры

#КонецОбласти
