#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	//++Диплом
	ПолучитьДанныеИзВременногоХранилища(Параметры.Адрес);
	//конец
КонецПроцедуры   

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПолучитьДанныеИзВременногоХранилища(Адрес)
	//++Диплом
	Данные = ПолучитьИзВременногоХранилища(Адрес);
	Объект.Год = Данные.Год;
	Объект.Номер = Данные.номер;
	Объект.Дата = Данные.Дата;
	ОтпускаСотрудников = Данные.ОтпускаСотрудников;

	Диаграмма.АвтоОпределениеПолногоИнтервала = Ложь;
	
	Диаграмма.Очистить(); 
	Диаграмма.Обновление = Ложь;  
	
	Диаграмма.УстановитьПолныйИнтервал(НачалоГода(Объект.Год), КонецГода(Объект.Год));
	
	Для Каждого Строка Из ОтпускаСотрудников Цикл
		ТекущаяТочка = Диаграмма.УстановитьТочку(Строка.Сотрудник);
		ТекущаяСерия = Диаграмма.УстановитьСерию("Отпуск");
		Значение = Диаграмма.ПолучитьЗначение(ТекущаяТочка, ТекущаяСерия);
		ТекущийИнтервал = Значение.Добавить(); 
		ТекущийИнтервал.Начало = Строка.ДатаНачала;
		ТекущийИнтервал.Конец = Строка.ДатаОкончания;
	КонецЦикла;
	
	Диаграмма.Обновление = Истина;
	//конец
КонецПроцедуры	

#КонецОбласти
