#Область ПрограммныйИнтерфейс 

&НаСервере
Процедура МассовоеСозданиеРеализацийПоДоговорам(Параметры, АдресРезультата) Экспорт
	//++Диплом 
	МассивРезультата = Новый Массив;
	
  	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДоговорыКонтрагентов.Ссылка КАК СсылкаНаДоговор,
		|	ДоговорыКонтрагентов.ВидДоговора КАК ВидДоговора,
		|	ДоговорыКонтрагентов.ВКМ_ДатаНачалаДействияДоговора КАК ДатаНачала,
		|	ДоговорыКонтрагентов.ВКМ_ДатаОкончанияДействияДоговора КАК ДатаОкончания,
		|	ДоговорыКонтрагентов.Организация КАК Организация,
		|	ДоговорыКонтрагентов.Владелец КАК Контрагент,
		|	ЕСТЬNULL(ВКМ_РеализацииКДоговорамСрезПоследних.Реализация, НЕОПРЕДЕЛЕНО) КАК Реализация
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВКМ_РеализацииКДоговорам.СрезПоследних(&КонецПериода, Период >= &НачалоПериода) КАК ВКМ_РеализацииКДоговорамСрезПоследних
		|		ПО ДоговорыКонтрагентов.Ссылка = ВКМ_РеализацииКДоговорамСрезПоследних.Договор.Ссылка
		|ГДЕ
		|	ДоговорыКонтрагентов.ВидДоговора = &ВидДоговора
		|	И НАЧАЛОПЕРИОДА(ДоговорыКонтрагентов.ВКМ_ДатаНачалаДействияДоговора, МЕСЯЦ) <= &НачалоПериода
		|	И КОНЕЦПЕРИОДА(ДоговорыКонтрагентов.ВКМ_ДатаОкончанияДействияДоговора, МЕСЯЦ) >= &КонецПериода";
	
	Запрос.УстановитьПараметр("ВидДоговора", Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание);
	Запрос.УстановитьПараметр("КонецПериода", Параметры.ДатаОкончания);
	Запрос.УстановитьПараметр("НачалоПериода", Параметры.ДатаНачала);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать(); 
	
	ВсегоДокументов = Выборка.Количество();
	ТекДок = 1;
	
	Пока Выборка.Следующий() Цикл
		Если Выборка.Реализация = НЕОПРЕДЕЛЕНО Тогда	
			НовыйДокумент = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
			НовыйДокумент.Дата = Параметры.ДатаОкончания;
			НовыйДокумент.Организация = Выборка.Организация;
			НовыйДокумент.Контрагент = Выборка.Контрагент;
			НовыйДокумент.Договор = Выборка.СсылкаНаДоговор;
			НовыйДокумент.ВыполнитьАвтозаполнение();
			НовыйДокумент.Записать();
		КонецЕсли;
		
		СтруктураДанных = Новый Структура;
		СтруктураДанных.Вставить("Договор", Выборка.СсылкаНаДоговор);
		СтруктураДанных.Вставить("Реализация", НовыйДокумент.Ссылка);
        	
		ПроцентВыполнения = (ТекДок/ВсегоДокументов)*100;
		ПроцентВыполнения = Окр(ПроцентВыполнения,0);
		
		ДлительныеОперации.СообщитьПрогресс(ПроцентВыполнения,СокрЛП(НовыйДокумент.Ссылка));
		
		ТекДок = ТекДок + 1;
		
		МассивРезультата.Добавить(ПроцентВыполнения);
		СтруктураДанных.Вставить("МассивРезультата", МассивРезультата);;
	КонецЦикла;  
	
	ПоместитьВоВременноеХранилище(СтруктураДанных, АдресРезультата);
	//конец
 КонецПроцедуры

#КонецОбласти

 